// ใช้ switch-case
#include <stdio.h>

int main() {
    int level;

    // รับข้อมูลระดับสมาชิกจากผู้ใช้
    printf("กรุณาป้อนระดับสมาชิกของคุณ (1=Silver, 2=Gold, 3=Platinum, 4=Diamond): ");
    scanf("%d", &level);

    printf("สิทธิประโยชน์ของคุณคือ: ");

    // ใช้ switch-case ในการตรวจสอบเงื่อนไข
    switch (level) {
        case 1:
            printf("5%% discount\n");
            break; // หยุดการทำงานเมื่อจบ case
        case 2:
            printf("10%% discount + Reward points\n");
            break;
        case 3:
            printf("15%% discount + Reward points + Birthday gift\n");
            break;
        case 4:
            printf("ได้ทุกอย่าง + VIP events\n");
            break;
        default:
            // กรณีที่ค่าไม่ตรงกับ case ไหนเลย
            printf("invalid membership level\n");
            break;
    }

    return 0;
}

//if-else → ใช้เวลาที่เงื่อนไขมันมีหลายปัจจัย ต้องเช็คว่า มากกว่า/น้อยกว่า หรือมีการต่อกันหลายชั้น
// เช่น ถ้าคะแนนเกิน 70 แต่ไม่ถึง 90, หรือ ถ้าเป็นสมาชิกพิเศษและยังไม่หมดอายุ
//switch → เหมาะกับตอนที่เรามีค่าชัดเจน แล้วอยากเลือกคำตอบจากลิสต์ที่เตรียมไว้
// เช่น เลือกโหมดหน้าจอ (light / dark / auto) หรือ เลือกวันในสัปดาห์ (จันทร์-อาทิตย์)
//สรุป ถ้าต้องเช็คแบบมีเงื่อนไขหลายมิติ ซับซ้อน หรือไม่ใช่ค่าตายตัว ใช้ if-else
//ถ้าต้องเช็คค่าชัดเจน ว่าตรงกับอันไหนในกลุ่ม ใช้ switch จะสั้นและดูเป็นระเบียบ

//if-else ตัดสินใจตามสถานการณ์ที่เปลี่ยนไป
//เหมือนการที่เลือกหนังที่จะดู ถ้าเหนื่อยมากอยากหัวเราะ = ดูหนังตลก
//ถ้าอยากลุ้นตื่นเต้น = ดูหนังแอ็กชัน /ถ้าอยากซึ้งๆ = ดูหนังแนวรัก
//มีหลายปัจจัยประกอบการตัดสินใจ เงื่อนไขไม่ตายตัว

//switch เลือกเมนูจากตัวเลือกที่ชัดเจน
//เหมือนเวลาไปกินพิซซ่า ถ้าสั่ง ฮาวายเอี้ยน จะได้หน้าฮาวายเอี้ยนตามที่สั่ง
//ถ้าสั่ง ซีฟู้ด = ได้หน้าซีฟู้ด
//ถ้าสั่ง เปปเปอโรนี = ได้หน้าเปปเปอโรนี
//มีเมนูที่ชัดเจน เลือกตรง ๆ จากตัวเลือก